/*Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и 
//           возводит число A в натуральную степень B.

double GetPow(){
    Console.Write("Введите число: ");
    double x = Convert.ToDouble(Console.ReadLine());
    double p = 1;
    Console.Write("Введите степерь: ");
    int y = Convert.ToInt32(Console.ReadLine());
    for (int i = 0; i < y; i++){
        p *= x;
    }
    return p;
}
System.Console.WriteLine(GetPow());

//*************************************************************************************
//**************************************************************************************
//**************************************************************************************


//Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

int GetSum(){
    int a = Convert.ToInt32(Console.ReadLine());
    int  sum = 0;
    while (a > 0){
        sum += a % 10;
        a /= 10;
    }
    return sum;
}
System.Console.WriteLine(GetSum());


//*************************************************************************************
//**************************************************************************************
//**************************************************************************************


Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.*/

int[] GetArray(int size =8){
    int[] arr = new int[size];
    for (int i = 0; i < arr.Length; i++){
        arr[i] = new Random().Next(10);
    }
    return arr;
}

foreach (var item in GetArray()){
    System.Console.WriteLine(item);
}