/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
           и на выходе показывает вторую цифру этого числа.
           
Console.WriteLine("Введите *трехзначное* число: ");
int num = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine($"{((num / 10) % 10)}");
.....................................................................................................
.....................................................................................................
.....................................................................................................
Задача 13: Напишите программу, которая выводит третью цифру заданного 
           числа или сообщает, что третьей цифры нет.

Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
if (num < 100){
    Console.WriteLine("третьей цифры нет");
}
else {
    while (num > 1000)
    {
    num /= 10;
    }
    Console.WriteLine(num % 10);
}
.....................................................................................................
.....................................................................................................
.....................................................................................................
Задача 15: Напишите программу, которая принимает на вход цифру, 
           обозначающую день недели, и проверяет, является ли этот день выходным.

Console.WriteLine("Введите число от 1 до 7: ");
int num = Convert.ToInt32(Console.ReadLine());
if (1 <= num  && num <= 7){
    if (num == 6 || num == 7){
        Console.WriteLine("да");
    } else {
        Console.WriteLine("нет");
    }
} else {
    Console.WriteLine("начните заново и введите число от 1 до 7");
}