//Задача 19
//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

string GetPolindrom(int num){
    int a = num / 10000;
    int b = num % 10;
    int c = (num / 1000) % 10;
    int d = (num % 100) / 10;
    if (a == b && c == d){
        return "да";
    } else {
        return "нет";
    }
}
System.Console.WriteLine(GetPolindrom(12321));


//**************************************************************************************
//**************************************************************************************
//**************************************************************************************


//Задача 21
//Напишите программу, которая принимает на вход координаты двух точек 
//и находит расстояние между ними в 3D пространстве.

double GetDistance(int x1, int y1, int h1, int x2, int y2, int h2){
    return Math.Sqrt(Math.Pow(x1 - x2, 2) + Math.Pow(y1 - y2, 2) + Math.Pow(h1 - h2, 2));
}
System.Console.WriteLine(GetDistance(3,6,8,2,1,-7))



//**************************************************************************************
//**************************************************************************************
//**************************************************************************************



//Задача 23
//Напишите программу, которая принимает на вход число (N) 
//и выдаёт таблицу кубов чисел от 1 до N.

int[] Get3(int num){
    int[] arr = new int[num];

    for (int i = 1; i <= num; i++){
        arr[i-1] = i * i * i;
    }
    return arr;
}
foreach (int num in Get3(5)){
    System.Console.WriteLine(num);
}